# IPipePressureDropServer Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPipePressureDropServer Interface
Members See Also
---
Interface for external servers implementing pipe pressure drop calculation.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public interface IPipePressureDropServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IPipePressureDropServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IPipePressureDropServer : IExternalServer
```

# Remarks
A typical way to use the external server can be:
  * Implement a server class that derives from this interface
  * Create a new server object and register it with the service, see ExternalServiceRegistry.
  * Assign server for the pipe pressure drop calculation in PipeSettings.

# See Also
IPipePressureDropServer Members
Autodesk.Revit.DB.Plumbing Namespace